Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.AddConnectionMatchType(Autodesk.Revit.DB.Structure.StructuralConnectionMatchType)
Adds the information about the type available for the Connection.
It does not check whether the array already contains given guid,
it is up to the caller to make sure there are no duplicates in the array.
matchType:
The object containing information about the type available for the Connection.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionsProviderData.#ctor(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Constructs a new instance of StructuralConnectionsProviderData.
document:
The document.
connectionId:
The Id of Connection Handler element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2017